stress_test_results-dup3/ab_test_0.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        TornadoServer/6.4.2
Server Hostname:        127.0.0.1
Server Port:            30070

Document Path:          /
Document Length:        1837 bytes

Concurrency Level:      500
Time taken for tests:   26.189 seconds
Complete requests:      50000
Failed requests:        0
Total transferred:      111150000 bytes
HTML transferred:       91850000 bytes
Requests per second:    1909.19 [#/sec] (mean)
Time per request:       261.891 [ms] (mean)
Time per request:       0.524 [ms] (mean, across all concurrent requests)
Transfer rate:          4144.66 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   2.9      0      43
Processing:     1  255 334.0    197    3484
Waiting:        1  255 333.9    197    3483
Total:          1  255 333.8    198    3485

Percentage of the requests served within a certain time (ms)
  50%    198
  66%    229
  75%    252
  80%    268
  90%    345
  95%   1151
  98%   1338
  99%   1608
 100%   3485 (longest request)